src/cf/ExchangePlans/ОбменРозницаБухгалтерияПредприятия30.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<ExchangePlan>
		<Properties>
			<Name>ОбменРозницаБухгалтерияПредприятия30</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередаватьНСИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПроведениеДокументовПриЗагрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоПодразделениямОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗарплатаВыплачиваетсяИзКассыВРозничнойОптовойСети</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузкиПриНеобходимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыгрузкиОбъектовОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодразделенияОрганизаций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

src/cf/ExchangePlans/ОбменРозницаБухгалтерияПредприятия30/Forms/ФормаНастройкиУзла/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбменДаннымиСервер.ФормаНастройкиУзлаПриСозданииНаСервере(ЭтаФорма, "ОбменРозницаБухгалтерияПредприятия30");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

//////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Отказ = Ложь;
	СтрокаОшибки = "";
	Если ИспользоватьОтборПоПодразделениямОрганизации И ПодразделенияОрганизаций.Количество() > 0 Тогда
		ПустыеПодразделенияМассив = ПодразделенияОрганизаций.НайтиСтроки(Новый Структура("ПодразделениеОрганизации", ПредопределенноеЗначение("Справочник.ПодразделенияОрганизаций.ПустаяСсылка")));
		Если ПустыеПодразделенияМассив.Количество() > 0 Тогда
			Отказ = Истина;
			СтрокаОшибки = "Не заполнено подразделение организации.";
		Иначе
			Для каждого ОрганизацияСтрока Из ПодразделенияОрганизаций Цикл
				Если (ИспользоватьОтборПоОрганизациям И Организации.Количество() > 0) Тогда
					НайденныеСтрокиОрганизации = Организации.НайтиСтроки(Новый Структура("Организация", ПолучитьРеквизитНаСервере(ОрганизацияСтрока.ПодразделениеОрганизации, "Владелец")));
					Если НайденныеСтрокиОрганизации.Количество() = 0 Тогда
						Отказ = Истина;
						СтрокаОшибки = "Организации отбора не соответствуют организациям подразделений организаций.";
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если Отказ Тогда
		Сообщить(СтрокаОшибки);
		возврат;
	КонецЕсли;
	ОбменДаннымиКлиент.ФормаНастройкиУзлаКомандаЗакрытьФорму(ЭтаФорма);
	
КонецПроцедуры // КомандаОК()

&НаКлиенте
Процедура ИспользоватьОтборПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры // ИспользоватьОтборПриИзменении()

//////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ТабличныеЧасти.ПодчиненныеЭлементы.СтраницаОрганизации.Видимость = ИспользоватьОтборПоОрганизациям;
	Элементы.ТабличныеЧасти.ПодчиненныеЭлементы.СтраницаПодразделенияОрганизации.Видимость = ИспользоватьОтборПоПодразделениямОрганизации;
	Элементы.ИспользоватьОтборПоПодразделениямОрганизации.Видимость = ЗарплатаВыплачиваетсяИзКассыВРозничнойОптовойСети;
	
КонецПроцедуры // УстановитьВидимость()

&НаКлиенте
Процедура ИспользоватьОтборПоПодразделениямОрганизацииПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры // ИспользоватьОтборПоПодразделениямОрганизацииПриИзменении

&НаКлиенте
Процедура ЗарплатаВыплачиваетсяИзКассыВРозничнойОптовойСетиПриИзменении(Элемент)
	Если ЗарплатаВыплачиваетсяИзКассыВРозничнойОптовойСети = Ложь Тогда
		ИспользоватьОтборПоПодразделениямОрганизации = Ложь;
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры // ЗарплатаВыплачиваетсяИзКассыВРозничнойОптовойСетиПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьРеквизитНаСервере(ОбъектДляЧтения, ИмяРеквизита) Экспорт
	МетаданныеОбъекта = ОбъектДляЧтения.Метаданные();
	Если (МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита) <> Неопределено) Или (ВРег(ИмяРеквизита)="ВЛАДЕЛЕЦ") Тогда 
		Возврат ОбъектДляЧтения[ИмяРеквизита];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
